{
    "commands": [
        {
            "text": "\"O you who have believed, decreed upon you is fasting as it was decreed upon those before you that you may become righteous.\"",
            "source": "— Surah Al-Baqarah 2:183"
        },
        {
            "text": "\"The month of Ramadhan [is that] in which was revealed the Qur'an, a guidance for the people and clear proofs of guidance and criterion.\"",
            "source": "— Surah Al-Baqarah 2:185"
        },
        {
            "text": "\"Whoever fasts Ramadan out of faith and in the hope of reward, his previous sins will be forgiven.\"",
            "source": "— Sahih Al-Bukhari"
        },
        {
            "text": "\"Allah said: 'Fasting is for Me and I will give the reward for it, for he leaves his sexual desire, food and drink for My sake.'\"",
            "source": "— Sahih Al-Bukhari (Hadith Qudsi)"
        },
        {
            "text": "\"There is a gate in Paradise called Ar-Rayyan, and those who observe fasts will enter through it on the Day of Resurrection.\"",
            "source": "— Sahih Al-Bukhari"
        }
    ],
    "warnings": [
        {
            "text": "\"I saw people hanging by their hamstrings, with the sides of their mouths torn and pouring blood. I said: Who are these? They said: These are the people who broke their fast before it was time.\"",
            "source": "— Sahih Ibn Khuzaymah"
        },
        {
            "text": "\"May his nose be rubbed in the dust, the man upon whom Ramadan enters and then passes before he is forgiven.\"",
            "source": "— Jami` at-Tirmidhi"
        },
        {
            "text": "\"Whoever does not give up false speech and acting upon it, Allah has no need of his giving up his food and drink.\"",
            "source": "— Sahih Al-Bukhari"
        },
        {
            "text": "\"There are many who fast, who gain nothing of their fast except hunger; and there are many who stand for the night prayer, who gain nothing of their prayer except sleeplessness.\"",
            "source": "— Sunan Ibn Majah"
        }
    ]
}